namespace Contracts;

public sealed class RegionsService
{
    public static List<string> Regions = new()
    {
        "София",
        "София област",
        "Благоевград",
        "Бургас",
        "Варна",
        "Велико Търново",
        "Видин",
        "Враца",
        "Габрово",
        "Добрич",
        "Кърджали",
        "Кюстендил",
        "Ловеч",
        "Монтана",
        "Пазарджик",
        "Перник",
        "Плевен",
        "Пловдив",
        "Разград",
        "Русе",
        "Силистра",
        "Сливен",
        "Смолян",
        "Стара Загора",
        "Търговище",
        "Хасково",
        "Шумен",
        "Ямбол"
    };
}